In [1]:
import pandas as pd

In [6]:
y = pd.Period('2016', 'A-DEC')

In [7]:
y.end_time

Timestamp('2016-12-31 23:59:59.999999999')

In [8]:
m = pd.Period('2016-12', freq='M')

In [10]:
m.start_time

Timestamp('2016-12-01 00:00:00')

In [19]:
m.end_time

Timestamp('2016-12-31 23:59:59.999999999')

In [21]:
m+1

Period('2017-01', 'M')

In [34]:
d = pd.Period('2017-01-28', freq='D')
d

Period('2017-01-28', 'D')

In [35]:
d + 2

Period('2017-01-30', 'D')

In [49]:
q = pd.Period('2017Q1', 'Q-JAN')
q

Period('2017Q1', 'Q-JAN')

In [50]:
q.start_time

Timestamp('2016-02-01 00:00:00')

In [52]:
q.end_time

Timestamp('2016-04-30 23:59:59.999999999')

In [53]:
idx = pd.period_range('2011', '2017', freq='Q-JAN')
idx

PeriodIndex(['2011Q4', '2012Q1', '2012Q2', '2012Q3', '2012Q4', '2013Q1',
             '2013Q2', '2013Q3', '2013Q4', '2014Q1', '2014Q2', '2014Q3',
             '2014Q4', '2015Q1', '2015Q2', '2015Q3', '2015Q4', '2016Q1',
             '2016Q2', '2016Q3', '2016Q4', '2017Q1', '2017Q2', '2017Q3',
             '2017Q4'],
            dtype='period[Q-JAN]', freq='Q-JAN')

In [56]:
idx[0].start_time

Timestamp('2010-11-01 00:00:00')

In [57]:
idx[0].end_time

Timestamp('2011-01-31 23:59:59.999999999')

In [60]:
import numpy as np

ps = pd.Series(np.random.RandomState(12).randn(len(idx)), index=idx)
ps

2011Q4    0.472986
2012Q1   -0.681426
2012Q2    0.242439
2012Q3   -1.700736
2012Q4    0.753143
2013Q1   -1.534721
2013Q2    0.005127
2013Q3   -0.120228
2013Q4   -0.806982
2014Q1    2.871819
2014Q2   -0.597823
2014Q3    0.472457
2014Q4    1.095956
2015Q1   -1.215169
2015Q2    1.342356
2015Q3   -0.122150
2015Q4    1.012515
2016Q1   -0.913869
2016Q2   -1.029530
2016Q3    1.209796
2016Q4    0.501872
2017Q1    0.138846
2017Q2    0.640761
2017Q3    0.527333
2017Q4   -1.154360
Freq: Q-JAN, dtype: float64

In [62]:
ps.loc['2011':'2013']

2011Q4    0.472986
2012Q1   -0.681426
2012Q2    0.242439
2012Q3   -1.700736
2012Q4    0.753143
2013Q1   -1.534721
2013Q2    0.005127
2013Q3   -0.120228
2013Q4   -0.806982
2014Q1    2.871819
2014Q2   -0.597823
2014Q3    0.472457
2014Q4    1.095956
Freq: Q-JAN, dtype: float64

In [64]:
pst = ps.to_timestamp()
pst

2010-11-01    0.472986
2011-02-01   -0.681426
2011-05-01    0.242439
2011-08-01   -1.700736
2011-11-01    0.753143
2012-02-01   -1.534721
2012-05-01    0.005127
2012-08-01   -0.120228
2012-11-01   -0.806982
2013-02-01    2.871819
2013-05-01   -0.597823
2013-08-01    0.472457
2013-11-01    1.095956
2014-02-01   -1.215169
2014-05-01    1.342356
2014-08-01   -0.122150
2014-11-01    1.012515
2015-02-01   -0.913869
2015-05-01   -1.029530
2015-08-01    1.209796
2015-11-01    0.501872
2016-02-01    0.138846
2016-05-01    0.640761
2016-08-01    0.527333
2016-11-01   -1.154360
Freq: QS-NOV, dtype: float64

In [65]:
pst.to_period()

2010Q4    0.472986
2011Q1   -0.681426
2011Q2    0.242439
2011Q3   -1.700736
2011Q4    0.753143
2012Q1   -1.534721
2012Q2    0.005127
2012Q3   -0.120228
2012Q4   -0.806982
2013Q1    2.871819
2013Q2   -0.597823
2013Q3    0.472457
2013Q4    1.095956
2014Q1   -1.215169
2014Q2    1.342356
2014Q3   -0.122150
2014Q4    1.012515
2015Q1   -0.913869
2015Q2   -1.029530
2015Q3    1.209796
2015Q4    0.501872
2016Q1    0.138846
2016Q2    0.640761
2016Q3    0.527333
2016Q4   -1.154360
Freq: Q-DEC, dtype: float64

In [83]:
df = pd.read_csv('./dataset/wmt.csv', index_col='Line Item')
df

           2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
Line Item
Revenue    115904  120854  118179  130936  117542
Expenses    86544   89485   87484   97743   87688
Profit      29360   31369   30695   33193   29854

In [86]:
df = df.T
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [87]:
df.index

Index(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='object')

In [88]:
df.index = pd.PeriodIndex(df.index, freq='Q-JAN')

In [89]:
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [90]:
df.index

PeriodIndex(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='period[Q-JAN]', freq='Q-JAN')

In [91]:
df['start date'] = df.index.map(lambda x: x.start_time)

In [92]:
df

Line Item  Revenue  Expenses  Profit start date
2017Q1      115904     86544   29360 2016-02-01
2017Q2      120854     89485   31369 2016-05-01
2017Q3      118179     87484   30695 2016-08-01
2017Q4      130936     97743   33193 2016-11-01
2018Q1      117542     87688   29854 2017-02-01

In [93]:
df['end date'] = df.index.map(lambda x: x.end_time)
df

Line Item  Revenue  Expenses  Profit start date                      end date
2017Q1      115904     86544   29360 2016-02-01 2016-04-30 23:59:59.999999999
2017Q2      120854     89485   31369 2016-05-01 2016-07-31 23:59:59.999999999
2017Q3      118179     87484   30695 2016-08-01 2016-10-31 23:59:59.999999999
2017Q4      130936     97743   33193 2016-11-01 2017-01-31 23:59:59.999999999
2018Q1      117542     87688   29854 2017-02-01 2017-04-30 23:59:59.999999999

In [101]:
df['end date'] = df['end date'].dt.date

In [102]:
df

Line Item  Revenue  Expenses  Profit start date    end date
2017Q1      115904     86544   29360 2016-02-01  2016-04-30
2017Q2      120854     89485   31369 2016-05-01  2016-07-31
2017Q3      118179     87484   30695 2016-08-01  2016-10-31
2017Q4      130936     97743   33193 2016-11-01  2017-01-31
2018Q1      117542     87688   29854 2017-02-01  2017-04-30